# Pandas

In [54]:
# first import the necessary libraries

import pandas as pd
import numpy as np

In [2]:
# creating a dataframe

df=pd.DataFrame(np.arange(0,10).reshape(2,5),index=['Row1','Row2'],columns=['col1','col2','col3','col4','col5'],dtype=int)

In [3]:
df #displays the table

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9

In [4]:
df.head() # dispalys the dataframe

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9

In [5]:
df.to_csv('dataframe1_trial.csv') # this creates a csv file in the file->home-> which contains the name of the csv file

In [6]:
#Accessing the elements
# 1. .loc  2. .iloc

df.loc['Row1']

col1    0
col2    1
col3    2
col4    3
col5    4
Name: Row1, dtype: int32

In [7]:
type(df.loc['Row1']) # this returns one col(may be one row also) which means it is a series so dtype is series

pandas.core.series.Series

In [9]:
  df.iloc[:, :]  # similar to numpy we have to mention row indexing in left and column indexing in right

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9

In [10]:
df.iloc[0:2,0:2]

      col1  col2
Row1     0     1
Row2     5     6

In [12]:
type(df.iloc[0:2,0:2]) # this returns more than one row or column which means it is a dataframe

pandas.core.frame.DataFrame

In [14]:
df

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9

In [15]:
# convert the dataframes to arrays

In [16]:
df.iloc[:,1:].values

array([[1, 2, 3, 4],
       [6, 7, 8, 9]])

In [17]:
df.iloc[:,1:].values.shape #returns the shape of the iloc changed array

(2, 4)

In [18]:
df['col1'].value_counts() #returns the count of each element in the column 1

col1
0    1
5    1
Name: count, dtype: int64

In [19]:
df

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9

In [20]:
df.isnull().sum() #checks for the null values in a df

col1    0
col2    0
col3    0
col4    0
col5    0
dtype: int64

In [23]:
df['col1'].unique() # gives the unique elements

array([0, 5])

In [24]:
df[['col1','col2']] #double bracket for more than one col accessing

      col1  col2
Row1     0     1
Row2     5     6

# Reading csv files with dataframe

In [27]:
df=pd.read_csv('KMEANS.csv') # reading existing csv files

In [28]:
df

   Individual  Variable1   Variable2
0           1         1.0        1.0
1           2         1.5        2.0
2           3         3.0        4.0
3           4         5.0        7.0
4           5         3.5        5.0
5           6         4.5        5.0
6           7         3.5        4.5

In [29]:
df.head() #returns top 5 records

   Individual  Variable1   Variable2
0           1         1.0        1.0
1           2         1.5        2.0
2           3         3.0        4.0
3           4         5.0        7.0
4           5         3.5        5.0

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Individual  7 non-null      int64
 1   Variable1   7 non-null      float64
 2   Variable2   7 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 300.0 bytes

In [31]:
 df.describe() #gives the numerical values column list only, if we have any categorical or alphabets they wont be taken into
    #account for this, as it contains count(),mean() which can be only be calculated for numerical values

       Individual  Variable1   Variable2
count    7.000000    7.000000   7.000000
mean     4.000000    3.142857   4.071429
std      2.160247    1.463850   2.008909
min      1.000000    1.000000   1.000000
25%      2.500000    2.250000   3.000000
50%      4.000000    3.500000   4.500000
75%      5.500000    4.000000   5.000000
max      7.000000    5.000000   7.000000

In [32]:
# Get the unique category counts

df['Individual'].value_counts()

Individual
1    1
2    1
3    1
4    1
5    1
6    1
7    1
Name: count, dtype: int64

In [34]:
df[df['Individual']>4] # displays the value of individual greater than 4 columns

   Individual  Variable1   Variable2
4           5         3.5        5.0
5           6         4.5        5.0
6           7         3.5        4.5

In [35]:
df.corr()

            Individual  Variable1   Variable2
Individual    1.000000    0.737865   0.672083
Variable1     0.737865    1.000000   0.973596
Variable2     0.672083    0.973596   1.000000

# CSV

In [36]:
from io import StringIO, BytesIO

In [37]:
data=('col1,col2,col3\n'
         'x,y,1\n'
         'a,b,2\n')

In [38]:
type(data)

str

In [39]:
StringIO()

In [40]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2

In [41]:
#Read specific columns
pd.read_csv(StringIO(data),usecols=['col1','col3'])

  col1  col3
0    x     1
1    a     2

In [42]:
df.to_csv('KMEANS.csv')

In [43]:
df

   Individual  Variable1   Variable2
0           1         1.0        1.0
1           2         1.5        2.0
2           3         3.0        4.0
3           4         5.0        7.0
4           5         3.5        5.0
5           6         4.5        5.0
6           7         3.5        4.5

In [46]:
## Specifying columns data types
data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11')

In [47]:
data

'a,b,c,d\n1,2,3,4\n5,6,7,8\n9,10,11'

In [48]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [49]:
df=pd.read_csv(StringIO(data),dtype=object) # object refers storing the values in string

In [50]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [51]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [56]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'d':'Int64'})

In [57]:
df

   a   b     c     d
0  1   2   3.0     4
1  5   6   7.0     8
2  9  10  11.0  <NA>

In [58]:
#check all datatypes

df.dtypes

a      int64
b      int32
c    float64
d      Int64
dtype: object

In [59]:
## Index columns and training delimiters
data = ('index,a,b,c\n'
'4, apple, bat, 5.7\n'
'8, orange, cow, 10')

df=pd.read_csv(StringIO(data), index_col=0) #index col num is specified

In [60]:
df

             a     b     c
index
4        apple   bat   5.7
8       orange   cow  10.0

In [62]:
pd.read_csv(StringIO(data), index_col=1) #makes the first index col as index col first

         index     b     c
a
 apple       4   bat   5.7
 orange      8   cow  10.0

In [65]:
data = ('a,b,c\n'
'4, apple, bat,\n'
'8,orange,cow,')
pd.read_csv(StringIO(data))

        a     b   c
4   apple   bat NaN
8  orange   cow NaN

In [66]:
pd.read_csv(StringIO(data),index_col=False) # if index_col is false we can get the index values by default

   a       b     c
0  4   apple   bat
1  8  orange   cow

In [69]:
## Combining usecols and index_col
data =('a,b,c\n'
'4,apple,bat,\n'
'8,orange,cow,')
pd.read_csv(StringIO(data), usecols=['b', 'c'], index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [71]:
## Quoting and Escape Characters. Very useful in NLP
data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'
pd.read_csv(StringIO(data), escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5

In [75]:
## URL to CSV
df=pd.read_csv('https://downloads.arduino.cc/packages/package_index.json',sep='\t')
df.head()

                                               {
0                                  "packages": [
1                                              {
2                             "name": "arduino",
3                       "maintainer": "Arduino",
4        "websiteURL": "http://www.arduino.cc/",

In [76]:
df

                                                   {
0                                      "packages": [
1                                                  {
2                                 "name": "arduino",
3                           "maintainer": "Arduino",
4            "websiteURL": "http://www.arduino.cc/",
...                                              ...
24873                                              }
24874                                              ]
24875                                              }
24876                                              ]
24877                                              }

[24878 rows x 1 columns]